"""
Напишите программу, которая считывает целое число и выводит текст,
аналогичный приведенному в примере (пробелы важны!).
ВВОД:
1534
ВЫВОД:
Следующее число после 1534 это 1535.
Предыдущее число перед 1534 это 1533.
"""
x = int(input())
print(f'Следующее число после {x} это {x + 1}.')
print(f'Предыдущее число перед {x} это {x - 1}.')





